000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/РазмещениеРекламныхМатериалов/РазмещениеРекламныхМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РазмещениеРекламныхМатериалов</name>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>РазмещениеРекламныхМатериалов</name>
      <type>
        <types>CatalogRef.РазмещениеРекламныхМатериалов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноеРазмещение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДоступноеКоличествоРазмещенийРекламныхМатериалов/ДоступноеКоличествоРазмещенийРекламныхМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоступноеКоличествоРазмещенийРекламныхМатериалов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДоступноеРазмещение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/РазмещениеРекламныхМатериалов/Forms/Форма/Module.bsl
&НаСервере
Процедура МагазинПриИзмененииНаСервере()
	
	Объект.ТЧ.Очистить();	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоступноеКоличествоРазмещенийРекламныхМатериаловСрезПоследних.Магазин КАК Магазин,
		|	ДоступноеКоличествоРазмещенийРекламныхМатериаловСрезПоследних.РазмещениеРекламныхМатериалов КАК РазмещениеРекламныхМатериалов,
		|	ДоступноеКоличествоРазмещенийРекламныхМатериаловСрезПоследних.ДоступноеРазмещение КАК ДоступноеРазмещение
		|ИЗ
		|	РегистрСведений.ДоступноеКоличествоРазмещенийРекламныхМатериалов.СрезПоследних(, Магазин = &Магазин) КАК ДоступноеКоличествоРазмещенийРекламныхМатериаловСрезПоследних";
	
	Запрос.УстановитьПараметр("Магазин",Объект.Магазин);
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ТЧ.Загрузить(РезультатЗапроса.Выгрузить());
	КонецПроцедуры

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	МагазинПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	Для каждого строка из Объект.ТЧ цикл
		НаборЗаписей = РегистрыСведений.ДоступноеКоличествоРазмещенийРекламныхМатериалов.СоздатьНаборЗаписей(); 

		НаборЗаписей.Отбор.Магазин.Установить(Объект.Магазин);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДата()); 
		НаборЗаписей.Отбор.РазмещениеРекламныхМатериалов.Установить(Строка.РазмещениеРекламныхМатериалов);

		НовЗапись = НаборЗаписей.Добавить();
		НовЗапись.Магазин = Объект.Магазин;
		НовЗапись.Период = ТекущаяДата();
		НовЗапись.РазмещениеРекламныхМатериалов = Строка.РазмещениеРекламныхМатериалов;
		НовЗапись.ДоступноеРазмещение = Строка.ДоступноеРазмещение; 

		НаборЗаписей.Записать(Истина);	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры
